app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "New article"], ["description", "New article created"], ["user_id", 2], ["created_at", "2016-01-30 06:07:18.809565"], ["updated_at", "2016-01-30 06:07:18.809565"]]
---
	def create
		@article = Article.new(article_params)
		@article.user = User.find(5)
		if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Second title edited"], ["description", "Second description edited"], ["updated_at", "2016-01-28 14:15:56.191077"], ["id", 7]]
---
	def update
		@article = Article.find(params[:id])
		if @article.update(article_params)